       78 TEN                    VALUE 10.
       78 THREE                  VALUE 3.

       01 MINI-PAIR.
          05 MINI-A              PIC 99 VALUE 0.
          05 MINI-B              PIC 99 VALUE 0.
