IDENTIFICATION DIVISION.
PROGRAM-ID. BOOLCHAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 1500000.
01 I PIC 9(7) VALUE 1.
01 ENABLED-FLAG PIC 9 VALUE 1.
01 DISABLED-FLAG PIC 9 VALUE 0.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    IF ENABLED-FLAG = 1 AND ( I > 0 OR DISABLED-FLAG = 1 ) AND NOT ( DISABLED-FLAG = 1 )
        ADD I TO ACC
    ELSE
        SUBTRACT 1 FROM ACC
    END-IF
    ADD 1 TO I
END-PERFORM
DISPLAY "BOOLCHAIN" ACC.
STOP RUN.
