IDENTIFICATION DIVISION.
PROGRAM-ID. CONSTPROP.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 1500000.
01 I PIC 9(7) VALUE 1.
01 STEP-VALUE PIC 9(3) VALUE 97.
01 OFFSET-VALUE PIC 9(2) VALUE 13.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    COMPUTE ACC = ACC + ( I * STEP-VALUE ) + OFFSET-VALUE
    ADD 1 TO I
END-PERFORM
DISPLAY "CONSTPROP" ACC.
STOP RUN.
