IDENTIFICATION DIVISION.
PROGRAM-ID. CONSTFOLD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 2000000.
01 I PIC 9(7) VALUE 1.
01 TERM PIC 9(9) VALUE 0.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    COMPUTE TERM = ( 17 * 19 ) + ( 23 * 29 ) - ( 5 * 7 ) + 11
    ADD TERM TO ACC
    ADD 1 TO I
END-PERFORM
DISPLAY "CONSTFOLD" ACC.
STOP RUN.
