IDENTIFICATION DIVISION.
PROGRAM-ID. DEADSTORE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 1500000.
01 I PIC 9(7) VALUE 1.
01 TEMP PIC 9(18) VALUE 0.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    COMPUTE TEMP = I * 3
    COMPUTE TEMP = I * 5
    COMPUTE TEMP = TEMP + 7
    ADD TEMP TO ACC
    ADD 1 TO I
END-PERFORM
DISPLAY "DEADSTORE" ACC.
STOP RUN.
