IDENTIFICATION DIVISION.
PROGRAM-ID. LCG.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 2000000.
01 I PIC 9(7) VALUE 1.
01 STATE PIC 9(9) VALUE 1.
01 CHECKSUM PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    COMPUTE STATE = ( STATE * 65 ) + 17
    COMPUTE STATE = FUNCTION MOD(STATE, 997)
    ADD STATE TO CHECKSUM
    ADD 1 TO I
END-PERFORM
DISPLAY "LCG" CHECKSUM.
STOP RUN.
