IDENTIFICATION DIVISION.
PROGRAM-ID. LOOPCANON.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 OUTER-LIMIT PIC 9(4) VALUE 1500.
01 INNER-LIMIT PIC 9(4) VALUE 2000.
01 I PIC 9(4) VALUE 1.
01 J PIC 9(4) VALUE 0.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL NOT ( I <= OUTER-LIMIT )
    MOVE 1 TO J
    PERFORM UNTIL NOT ( J <= INNER-LIMIT )
        COMPUTE ACC = ACC + I + J
        ADD 1 TO J
    END-PERFORM
    ADD 1 TO I
END-PERFORM
DISPLAY "LOOPCANON" ACC.
STOP RUN.
