IDENTIFICATION DIVISION.
PROGRAM-ID. SMALLWIDTH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 1680000.
01 I PIC 9(7) VALUE 1.
01 A PIC 9 VALUE 0.
01 B PIC 9 VALUE 0.
01 C PIC 9(2) VALUE 0.
01 D PIC 9(2) VALUE 0.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    ADD 1 TO A
    IF A > 7
        MOVE 0 TO A
    END-IF
    ADD 1 TO B
    IF B > 9
        MOVE 0 TO B
    END-IF
    ADD 1 TO C
    IF C > 11
        MOVE 0 TO C
    END-IF
    ADD 1 TO D
    IF D > 13
        MOVE 0 TO D
    END-IF
    COMPUTE ACC = ACC + A + B + C + D
    ADD 1 TO I
END-PERFORM
DISPLAY "SMALLWIDTH" ACC.
STOP RUN.
