IDENTIFICATION DIVISION.
PROGRAM-ID. STRENGTH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 LOOP-LIMIT PIC 9(7) VALUE 2000000.
01 I PIC 9(7) VALUE 1.
01 ACC PIC 9(18) VALUE 0.

PROCEDURE DIVISION.
PERFORM UNTIL I > LOOP-LIMIT
    COMPUTE ACC = ACC + ( I * 8 ) + ( I * 4 ) + ( I * 2 )
    ADD 1 TO I
END-PERFORM
DISPLAY "STRENGTH" ACC.
STOP RUN.
