IDENTIFICATION DIVISION.
PROGRAM-ID. COLLATZ.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9(8) VALUE 27.
01 STEPS PIC 9(8) VALUE 0.
01 MAX-VALUE PIC 9(10) VALUE 27.

PROCEDURE DIVISION.
DISPLAY "COLLATZ SEED" N.
PERFORM UNTIL N = 1
    IF N MOD 2 = 0
        DIVIDE 2 INTO N
    ELSE
        COMPUTE N = ( N * 3 ) + 1
    END-IF
    ADD 1 TO STEPS
    IF N > MAX-VALUE
        MOVE N TO MAX-VALUE
    END-IF
END-PERFORM
DISPLAY "STEPS" STEPS.
DISPLAY "MAX" MAX-VALUE.
STOP RUN.
