IDENTIFICATION DIVISION.
PROGRAM-ID. GCD.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(9) VALUE 0.
01 B PIC 9(9) VALUE 0.
01 REM PIC 9(9) VALUE 0.

PROCEDURE DIVISION.
DISPLAY "ENTER TWO INTEGERS".
ACCEPT A.
ACCEPT B.
PERFORM UNTIL B = 0
    COMPUTE REM = FUNCTION MOD(A, B)
    MOVE B TO A
    MOVE REM TO B
END-PERFORM
DISPLAY "GCD" A.
STOP RUN.
