IDENTIFICATION DIVISION.
PROGRAM-ID. ALPHACMP.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CELL PIC X(1) VALUE "D".
PROCEDURE DIVISION.
MAIN-PARA.
    IF CELL = "D"
        DISPLAY "DOOR"
    END-IF
    IF CELL <> "."
        DISPLAY "SOLID"
    END-IF
    STOP RUN.
