IDENTIFICATION DIVISION.
PROGRAM-ID. CALLIDXV.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VALUES.
    05 VALUE-ITEM PIC 9(4) OCCURS 3 TIMES.
01 IDX PIC 9(1) VALUE 2.
01 TOTAL PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE 5 TO VALUE-ITEM(1)
    MOVE 7 TO VALUE-ITEM(2)
    MOVE 9 TO VALUE-ITEM(3)
    CALL "sum_and_scale" USING BY VALUE VALUE-ITEM(IDX) 4 3 RETURNING TOTAL
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
