IDENTIFICATION DIVISION.
PROGRAM-ID. CALLALPH.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TEXT PIC X(5) VALUE "HELLO".
01 CODE PIC 9(3) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    CALL "first_char_code" USING BY REFERENCE TEXT RETURNING CODE
    DISPLAY "CODE " CODE
    STOP RUN.
