IDENTIFICATION DIVISION.
PROGRAM-ID. CMPINDEX.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 VALUE-TABLE.
   05 VALUE-ENTRY OCCURS 3 TIMES.
      10 VALUE-ITEM PIC 9(4) VALUE 0.
01 IDX PIC 9(4) VALUE 2.
PROCEDURE DIVISION.
MAIN-PARA.
    COMPUTE VALUE-ITEM(IDX) =
        VALUE-ITEM(IDX) + 7
    DISPLAY "VALUE " VALUE-ITEM(2)
    STOP RUN.
