IDENTIFICATION DIVISION.
PROGRAM-ID. CONTSTMT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 FLAG PIC 9(1) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    IF FLAG = 0
        CONTINUE
    END-IF
    DISPLAY "OK"
    STOP RUN.
