IDENTIFICATION DIVISION.
PROGRAM-ID. COPYBOOK-CONSTS.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "mini_consts.cpy".

PROCEDURE DIVISION.
    MOVE TEN TO MINI-A
    COMPUTE MINI-B = TEN - THREE
    DISPLAY MINI-A " " MINI-B
    GOBACK.
