IDENTIFICATION DIVISION.
PROGRAM-ID. DISPLAY-TRIM-TRAILING.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BUF PIC X(8) VALUE "ABCD    ".

PROCEDURE DIVISION.
    DISPLAY FUNCTION TRIM(BUF TRAILING)
    STOP RUN.
