IDENTIFICATION DIVISION.
PROGRAM-ID. ELSEIFCHAIN.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LEVEL PIC 9 VALUE 2.
PROCEDURE DIVISION.
MAIN-PARA.
    IF LEVEL = 1
        DISPLAY "ONE"
    ELSE IF LEVEL = 2
        DISPLAY "TWO"
    ELSE IF LEVEL = 3
        DISPLAY "THREE"
    ELSE
        DISPLAY "OTHER"
    END-IF
    STOP RUN.
