IDENTIFICATION DIVISION.
PROGRAM-ID. ENTRY-BEFORE-PARAGRAPH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 X PIC 9 VALUE 0.

PROCEDURE DIVISION.
    MOVE 1 TO X
    PERFORM SHOW-X
    GOBACK.

SHOW-X.
    DISPLAY X
    .
