IDENTIFICATION DIVISION.
PROGRAM-ID. EVALVALUE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LEVEL PIC 9(4) VALUE 2.
PROCEDURE DIVISION.
MAIN-PARA.
    EVALUATE LEVEL
        WHEN 1
            DISPLAY "ONE"
        WHEN 2
            DISPLAY "TWO"
        WHEN OTHER
            DISPLAY "OTHER"
    END-EVALUATE
    STOP RUN.
