IDENTIFICATION DIVISION.
PROGRAM-ID. EVALINLINE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 LEVEL PIC 9(4) VALUE 3.
01 TOTAL PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    EVALUATE LEVEL
        WHEN 1 MOVE 10 TO TOTAL
        WHEN 2 MOVE 20 TO TOTAL
        WHEN OTHER MOVE 99 TO TOTAL
    END-EVALUATE
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
