IDENTIFICATION DIVISION.
PROGRAM-ID. FUNSQRT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ROOT PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    COMPUTE ROOT = FUNCTION SQRT
        (81)
    DISPLAY "ROOT " ROOT
    STOP RUN.
