IDENTIFICATION DIVISION.
PROGRAM-ID. GROCCCHILD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 BOARD.
    05 ROW OCCURS 2 TIMES.
        10 CELL PIC X(4).
        10 SCORE PIC 9(4).
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE "ABCD" TO CELL(1)
    MOVE 12 TO SCORE(1)
    MOVE "WXYZ" TO CELL(2)
    MOVE 42 TO SCORE(2)
    DISPLAY ROW(1)
    DISPLAY ROW(2)
    MOVE ROW(1) TO ROW(2)
    DISPLAY ROW(2)
    STOP RUN.
