IDENTIFICATION DIVISION.
PROGRAM-ID. GRPACCEPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-REC.
    05 INPUT-TAG PIC X(4).
    05 INPUT-COUNT PIC 9(4).
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT INPUT-REC
    DISPLAY INPUT-REC
    STOP RUN.
