IDENTIFICATION DIVISION.
PROGRAM-ID. GROCCVAL.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 ENEMY-TABLE.
   05 ENEMY-ENTRY OCCURS 3 TIMES.
      10 ENEMY-TYPE PIC 9(4) VALUE 1.
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY "TYPE " ENEMY-TYPE(1) " " ENEMY-TYPE(2) " " ENEMY-TYPE(3)
    STOP RUN.
