IDENTIFICATION DIVISION.
PROGRAM-ID. GROCCACPT.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 BOARD.
    05 ROW OCCURS 2 TIMES.
        10 CELL PIC X(4).
        10 SCORE PIC 9(4).
PROCEDURE DIVISION.
MAIN-PARA.
    ACCEPT ROW(2)
    DISPLAY ROW(2)
    DISPLAY CELL(2) SCORE(2)
    STOP RUN.
