IDENTIFICATION DIVISION.
PROGRAM-ID. GROUPTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 PLAYER.
    05 SCORE PIC 9(4) VALUE 7.
    05 NAME PIC X(4) VALUE "DOOM".
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY NAME
    ADD 5 TO SCORE
    DISPLAY "SCORE " SCORE
    STOP RUN.
