IDENTIFICATION DIVISION.
PROGRAM-ID. MOVE-NUMERIC-TO-PICX.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 DIGIT PIC 9 VALUE 7.
01 BUF PIC X(4) VALUE SPACES.

PROCEDURE DIVISION.
    MOVE DIGIT TO BUF(2:1)
    DISPLAY "[" BUF "]"
    STOP RUN.
