>>SOURCE FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MOVEIDX.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 9(4) VALUE 2.
01 X PIC 9(4) VALUE 0.
01 ARR OCCURS 4 PIC 9(4).
PROCEDURE DIVISION.
    MOVE 7 TO ARR(1)
    MOVE 9 TO ARR(2)
    MOVE ARR(I - 1) TO X
    DISPLAY X
    STOP RUN.
