IDENTIFICATION DIVISION.
PROGRAM-ID. MULTILINE-MOVE-ALPHA.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BUF PIC X(8) VALUE "XXXXXXXX".

PROCEDURE DIVISION.
    MOVE SPACES TO BUF
    MOVE "ABCD" TO
        BUF(1:4)
    DISPLAY "[" BUF "]"
    STOP RUN.
