IDENTIFICATION DIVISION.
PROGRAM-ID. MULTICOMP.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(4) VALUE 2.
01 B PIC 9(4) VALUE 3.
01 C PIC 9(4) VALUE 4.
01 TOTAL PIC 9(5) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    COMPUTE TOTAL =
        A +
        B *
        C
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
