IDENTIFICATION DIVISION.
PROGRAM-ID. MULTIIF.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(4) VALUE 2.
01 B PIC 9(4) VALUE 3.
01 TOTAL PIC 9(4) VALUE 5.
PROCEDURE DIVISION.
MAIN-PARA.
    IF ( A +
        B ) = TOTAL AND
        TOTAL > 0
        DISPLAY "MATCH"
    ELSE
        DISPLAY "MISS"
    END-IF
    STOP RUN.
