IDENTIFICATION DIVISION.
PROGRAM-ID. OCCURSALPHA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CELL-TEXT PIC X(4) OCCURS 2 TIMES.
01 IDX PIC 9(4) VALUE 2.
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE "ALFA" TO CELL-TEXT(1)
    MOVE "BETA" TO CELL-TEXT(IDX)
    DISPLAY CELL-TEXT(1)
    DISPLAY CELL-TEXT(2)
    STOP RUN.
