IDENTIFICATION DIVISION.
PROGRAM-ID. PARAGRAPHS.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TOTAL PIC 9(4) VALUE 0.
01 STEP PIC 9(4) VALUE 1.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM ADD-STEP
    PERFORM ADD-STEP
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
ADD-STEP.
    ADD STEP TO TOTAL.
