IDENTIFICATION DIVISION.
PROGRAM-ID. PERFVARY.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 TOTAL PIC 9(4) VALUE 0.
01 IDX PIC 9(4) VALUE 0.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM VARYING IDX FROM 1 BY 1
        UNTIL IDX > 4
        ADD IDX TO TOTAL
    END-PERFORM
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
