IDENTIFICATION DIVISION.
PROGRAM-ID. PERFPARA.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 STEP-COUNT PIC 9(4) VALUE 0.
01 GOAL PIC 9(4) VALUE 3.
PROCEDURE DIVISION.
MAIN-PARA.
    PERFORM STEP-PARA UNTIL STEP-COUNT >= GOAL
    DISPLAY "COUNT " STEP-COUNT
    STOP RUN.
STEP-PARA.
    ADD 1 TO STEP-COUNT.
