IDENTIFICATION DIVISION.
PROGRAM-ID. PICXTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NAME PIC X(5) VALUE "ALFA".
01 TEMP-NAME PIC X(5).
PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY NAME
    MOVE "BETA" TO TEMP-NAME
    MOVE TEMP-NAME TO NAME
    DISPLAY NAME
    STOP RUN.
