IDENTIFICATION DIVISION.
PROGRAM-ID. PICXREFM.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 BUFFER-V PIC X(5) VALUE "ABCDE".
01 IDX PIC 9(1) VALUE 3.
01 CELL PIC X(1).
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE BUFFER-V(IDX:1) TO CELL
    MOVE "." TO BUFFER-V(2:1)
    DISPLAY CELL
    DISPLAY BUFFER-V
    STOP RUN.
