IDENTIFICATION DIVISION.
PROGRAM-ID. REDEFTEST.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 BASE PIC 9(4) VALUE 7.
01 ALIAS REDEFINES BASE PIC 9(4).
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE 12 TO ALIAS
    DISPLAY "BASE " BASE
    STOP RUN.
