IDENTIFICATION DIVISION.
PROGRAM-ID. SIGNEDCOMP.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 DELTA PIC S9(4) COMP-5 VALUE 0.
01 TOTAL PIC 9(4) VALUE 3.
PROCEDURE DIVISION.
MAIN-PARA.
    MOVE 7 TO DELTA
    SUBTRACT 12 FROM DELTA
    ADD 9 TO DELTA
    ADD DELTA TO TOTAL
    DISPLAY "TOTAL " TOTAL
    STOP RUN.
